Ruby/curriculum/app/views/tracks/show.html.erb


<% if @track.lessons.any? %>
---
SELECT "lessons".* FROM "lessons" INNER JOIN "lesson_tracks" ON "lessons"."id" = "lesson_tracks"."lesson_id" WHERE "lesson_tracks"."track_id" = $1  [["track_id", 4]]
SELECT  1 AS one FROM "lessons" INNER JOIN "lesson_tracks" ON "lessons"."id" = "lesson_tracks"."lesson_id" WHERE "lesson_tracks"."track_id" = $1 LIMIT $2  [["track_id", 1], ["LIMIT", 1]]

    <ul>
      <% @track.lessons.each do |lesson| %>
---
SELECT "lessons".* FROM "lessons" INNER JOIN "lesson_tracks" ON "lessons"."id" = "lesson_tracks"."lesson_id" WHERE "lesson_tracks"."track_id" = $1  [["track_id", 4]]