Ruby/curriculum/app/controllers/lessons_controller.rb

SELECT "lessons".* FROM "lessons" WHERE (lower(title) like '%minus%' OR lower(content) like '%minus%')
---
  def index
    if params[:sort_by]
      case params[:sort_by]
      when 'name, asc', 'name, desc', 'created_at, asc', 'created_at, desc'
        method = params[:sort_by].split(', ')
        @lessons = Lesson.sort_by_method(method)
      else
        flash[:notice] = "Invalid sorting method"
        @lessons = Lesson.all

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT $2  [["id", 106], ["LIMIT", 1]]
---
  def edit
    @lesson = Lesson.find(params[:id])

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  1 AS one FROM "tracks" INNER JOIN "lesson_tracks" ON "tracks"."id" = "lesson_tracks"."track_id" WHERE "lesson_tracks"."lesson_id" = $1 LIMIT $2  [["lesson_id", 11], ["LIMIT", 1]]
SELECT "tracks".* FROM "tracks" INNER JOIN "lesson_tracks" ON "tracks"."id" = "lesson_tracks"."track_id" WHERE "lesson_tracks"."lesson_id" = $1  [["lesson_id", 11]]
---
  def show
    @lesson = Lesson.find(params[:id])
    if params[:track_to_add]
      track = Track.find(params[:track_to_add])
      if @lesson.tracks.include? track