Ruby/curriculum/app/controllers/tracks_controller.rb

SELECT "tracks".* FROM "tracks" ORDER BY name asc
---
  def index
    if params[:sort_by]
      case params[:sort_by]
      when 'name, asc', 'name, desc', 'created_at, asc', 'created_at, desc'
        method = params[:sort_by].split(', ')
        @tracks = Track.sort_by_method(method)
      else
        flash[:notice] = "Invalid sorting method"
        @tracks = Track.all

INSERT INTO "tracks" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Intro"], ["created_at", "2020-01-14 18:24:59.033226"], ["updated_at", "2020-01-14 18:24:59.033226"]]
---
  def create
    @track = Track.new(track_params)
    if @track.save

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "lessons" INNER JOIN "lesson_tracks" ON "lessons"."id" = "lesson_tracks"."lesson_id" WHERE "lesson_tracks"."track_id" = $1 LIMIT $2  [["track_id", 1], ["LIMIT", 1]]
SELECT "lessons".* FROM "lessons" INNER JOIN "lesson_tracks" ON "lessons"."id" = "lesson_tracks"."lesson_id" WHERE "lesson_tracks"."track_id" = $1  [["track_id", 4]]
---
  def show
    @track = Track.find(params[:id])
    if params[:lesson_to_add]
      lesson = Lesson.find(params[:lesson_to_add])
      if @track.lessons.include? lesson