Ruby/curriculum/app/views/lessons/show.html.erb

SELECT "tracks".* FROM "tracks" INNER JOIN "lesson_tracks" ON "tracks"."id" = "lesson_tracks"."track_id" WHERE "lesson_tracks"."lesson_id" = $1  [["lesson_id", 11]]
SELECT  1 AS one FROM "tracks" INNER JOIN "lesson_tracks" ON "tracks"."id" = "lesson_tracks"."track_id" WHERE "lesson_tracks"."lesson_id" = $1 LIMIT $2  [["lesson_id", 11], ["LIMIT", 1]]
---

<% if @lesson.tracks.any? %>

SELECT "tracks".* FROM "tracks" INNER JOIN "lesson_tracks" ON "tracks"."id" = "lesson_tracks"."track_id" WHERE "lesson_tracks"."lesson_id" = $1  [["lesson_id", 11]]
---
    <ul>
      <% @lesson.tracks.each do |track| %>